-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- 主機： localhost
-- 產生時間： 2021 年 05 月 07 日 16:51
-- 伺服器版本： 10.4.18-MariaDB
-- PHP 版本： 8.0.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `Museum`
--

-- --------------------------------------------------------

--
-- 資料表結構 `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `username` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '使用者帳號',
  `pwd` char(40) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '使用者密碼',
  `created_at` datetime NOT NULL DEFAULT current_timestamp() COMMENT '新增時間',
  `updated_at` datetime NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '更新時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='管理者帳號';

--
-- 傾印資料表的資料 `admin`
--

INSERT INTO `admin` (`id`, `username`, `pwd`, `created_at`, `updated_at`) VALUES
(1, 'admin', 'a94a8fe5ccb19ba61c4c0873d391e987982fbbd3', '2021-05-01 12:26:14', '2021-05-02 13:10:40');

-- --------------------------------------------------------

--
-- 資料表結構 `city`
--

CREATE TABLE `city` (
  `cityId` varchar(9) COLLATE utf8mb4_unicode_ci NOT NULL,
  `cityName` varchar(9) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `city`
--

INSERT INTO `city` (`cityId`, `cityName`) VALUES
('CHA', '彰化縣'),
('CYQ', '嘉義縣'),
('HSQ', '新竹縣'),
('HUA', '花蓮縣'),
('ILA', '宜蘭縣'),
('KIN', '金門縣'),
('LIE', '連江縣'),
('MIA', '苗栗縣'),
('NAN', '南投縣'),
('PEN', '澎湖縣'),
('PIF', '屏東縣'),
('TTT', '臺東縣'),
('YUN', '雲林縣'),
('CYI', '嘉義市'),
('HSZ', '新竹市'),
('KEE', '基隆市'),
('KHH', '高雄市'),
('NWT', '新北市'),
('TAO', '桃園市'),
('TNN', '臺南市'),
('TPE', '臺北市'),
('TXG', '臺中市');

-- --------------------------------------------------------

--
-- 資料表結構 `event`
--

CREATE TABLE `event` (
  `id` int(11) NOT NULL COMMENT '流水號',
  `eventClass` varchar(5) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '商品類別',
  `eventId` varchar(9) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '活動編號',
  `eventName` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '活動名稱',
  `eventDescription` text COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '活動描述',
  `eventDateStart` date NOT NULL COMMENT '活動開始日期',
  `eventDateEnd` date NOT NULL COMMENT '活動結束日期',
  `eventPrice` int(11) NOT NULL COMMENT '活動價格',
  `eventImg` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '活動圖片',
  `eventCity` varchar(9) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '活動城市',
  `museumId` varchar(9) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '舉辦館別',
  `userId` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '建立活動的使用者',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '新增時間',
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp() COMMENT '修改時間'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `event`
--

INSERT INTO `event` (`id`, `eventClass`, `eventId`, `eventName`, `eventDescription`, `eventDateStart`, `eventDateEnd`, `eventPrice`, `eventImg`, `eventCity`, `museumId`, `userId`, `created_at`, `updated_at`) VALUES
(1, 'C', '001', 'WHAAAAAT’S', '第二屆WHAAAAAT’S展會將於2021年5月7-9日再次盛大舉行，選址於台北喜來登大飯店。自2020年2月始，一場疫症改變了人與人之間的距離，更改變了你我所熟悉的藝術生態。本屆展會主題為「我們的時代」，我們一定要懷抱希望、保持樂觀；期許藉由藝術家們精彩的創作，為我們所處的時代發聲，用美好的創作，為自己說話也溫暖他人，用正向熱情的創作，喚起大眾對自身時代的認同與重視，將藝術的愛傳遞給每一人。\r\n', '2021-06-01', '2021-06-14', 100, '001.jpg', 'CLI', '', '', '2021-05-05 13:01:32', '2021-05-05 13:01:32'),
(2, 'C', '002', '新一代設計展YODEX\r\n', '新一代設計展」自1981年開辦以來，致力將展覽朝品牌化、專業化、國際化之方向推進，今年邁入第40年，目前已是全球最具規模之設計科系學生主題聯展。展覽內容橫跨產品與工藝設計、視覺傳達設計、數位多媒體設計、空間與建築設計、服裝與時尚設計、跨領域整合設計等等多元領域。今年有全台66校、144系、約12,000位設計新秀、4,000件作品參與展出。 除展覽外，另結合金點新秀設計獎、新一代產學合作專案，廣邀企業參與，是台灣發掘優秀設計人才與傑出創意之重要平台。\r\n', '2021-06-10', '2021-06-29', 250, '002.jpg', 'TPE', '', '', '2021-05-05 13:01:48', '2021-05-05 13:01:48'),
(3, 'C', '003', 'What is TEDxDongWuU？\r\n', 'TED為美國一個國際性非營利組織，秉持著好點子值得傳遞(Ideas worthspreading)的精神，從1984年創立以來，逐步將全世界各個角落的好點子，匯集在網路平台，實踐了知識傳遞之目的。TED每年舉辦為期一週的大型年會，邀請眾多講者以簡報的方式傳達想法與知識，搭配精心營造的年會氣氛，讓傳遞點子變得輕鬆有趣。\r\n而著名的TEDTalk簡報，包含TED與TEDx的演講內容，以18分鐘為限，並且搭配無數生動的故事，成為全世界最啟發人心的簡報方式。TED官方網站將這些TEDTalk免費提供全球點閱，並翻譯成多國語言，使知識無國界，讓好點子遍佈全球。\r\nTEDxEvent是延續TED的精神，結合地方社群特色與需求的獨立組織，讓人們不只坐在電腦前看影片，也能走出家中，體驗TED conference獨有的現場氣氛，讓每個人能夠參與其中，並且與有共同熱忱的人分享、交流。\r\nWhat is TEDxDongWuU？\r\n', '2021-06-23', '2021-06-28', 350, '003.jpg', 'TPE', '', '', '2021-05-05 13:05:17', '2021-05-05 13:05:17'),
(4, 'C', '004', 'INITIATION', '國立臺灣師範大學美術系成立於1947年8月，為臺灣第一所大專院校成立的美術相關科系，匯聚自中國與留學日本返臺的名師，推動臺灣基礎美育，培育出多面向創作思維的藝術家，繼而影響臺灣藝壇動向。而臺師大設立於現今的古亭，清朝舊名為「鼓亭莊」，是瑠公圳的重要樞紐，過去滋潤的是大地的農產；臺師大在此地建校後，變成教育的源泉，源源不絕的將智慧向四處傳播、蔓延開來。\r\n \r\n「引藝領潮——1947・鼓亭莊聯展」透過曾就學及授教於臺師大美術系、現今為藝術界中各領域翹楚的部分作品，策畫面向公眾的展覽；透過教育單位或館舍的典藏，具體而微的組構出這塊土地上饒具特色的藝文歷史脈絡。\r\n', '2021-06-23', '2021-07-08', 80, '004.jpg', 'TXG', '', '', '2021-05-05 13:05:17', '2021-05-05 13:05:17'),
(5, 'C', '005', '紙膠帶的100種可能', '【紙膠帶的100種可能】 創意紙膠帶拼貼創作競賽\r\n由大年印刷x大米創意所主辦的「紙給你膠帶」系列活動已邁入第三年，為了擴大活動參與的廣度，更期望透過活動讓民眾體驗紙膠帶的無限可能，本屆將以跨年度系列活動方式，舉辦兩階段的紙膠帶創意競賽，讓民眾可從參與紙膠帶設計，到實際應用紙膠帶創作，一同進入紙膠帶的歡樂世界。', '2021-06-24', '2021-07-05', 50, '005.jpg', 'TNN', '', '', '2021-05-05 13:11:03', '2021-05-05 13:11:03'),
(6, 'C', '006', '解碼雲端', '2014年，牯嶺街小劇場憑藉著跨越時代的建物歷史，以及它從軍警機構轉變成劇場的文化內涵，冊列為台北市的歷史建築。2020年，完成歷史建築整修、重新整裝出發的牯嶺街小劇場將推出「重啟城中之心」計畫，期待透過新一波的展演創作單元與歷史空間相互對話，打開一個全新的生活交流場域，進而支持表演藝術工作者探索更具挑戰性的視野，為重新開放的小劇場增添新能量！\r\n', '2021-06-29', '2021-07-15', 150, '006.jpg', 'CHW', '', '', '2021-05-05 13:11:03', '2021-05-05 13:11:03'),
(7, 'C', '007', '探索臺北城', '台北文青小旅行再解鎖! 鬧區中心的自來水博物館，竟然埋著屬於台北人的地下宮殿! ! 地下水宮殿像好酒一樣私藏的越陳越香，有著台北天堂路的新生南路竟然有這麼多故事，文藝選染著城中的色彩，是時候來個文青小旅行了!', '2021-06-28', '2021-07-07', 150, '007.jpg', 'TPE', '', '', '2021-05-05 13:29:02', '2021-05-05 13:29:02'),
(8, 'C', '008', '塑象-動物雕塑體驗', '藝術家將在沒有專業美術背景的前題之下，教導大家如何以簡單、有效果的方式捏塑一個動物頭像！ 這次課程的主題為-大象，在4小時的課程時間中，藝術家將帶領參與學員瞭解雕塑家如何思考造型，並以簡單明瞭的方式帶大家進行親手實踐。\r\n', '2021-07-01', '2021-07-15', 400, '008.jpg', 'KHH', '', '', '2021-05-05 13:29:02', '2021-05-05 13:29:02'),
(9, 'C', '009', '巷弄之間-尋找藏達人計畫', '活動多於戶外進行，請自備防曬用品/雨具。\r\n環保愛地球，請參加者自行攜帶飲用水。\r\n出發當天請準時報到，逾時不候，亦不退費。\r\n出發日前 8 日退費需收取10%手續費\r\n出發日前 8 日至當日內不接受取消，並不予退回款項。\r\n如因天災等不可抗力因素，主辦單位將主動聯繫延期或退款。\r\n若人數不足無法成行，主辦單位將於7日前另行通知改期或全額退費。\r\n主辦單位保有調整、修改活動之權利。\r\n', '2021-07-02', '2021-07-04', 250, '009.jpg', 'SMT', '', '', '2021-05-05 13:29:02', '2021-05-05 13:29:02'),
(10, 'C', '010', '臺博館建築再發現', '《臺博館建築再發現－談臺博館及其建築師野村一郎》\r\n臺灣博物館本館是臺灣唯一一座不僅保留了其原本歷史主義建築形式，而且繼續履行其最初展覽館功能的日治時期官方建築。\r\n在這場座談中，講者除了分析臺博館建築物的形式和結構外，也將聚焦於臺博館的設計師野村一郎( Ichirō Nomura，1868－1942)在1910年前往歐美，尤其是倫敦和紐約的旅程中，可能看到過哪些建築物及城市景觀而成為影響臺博館建築設計的參考原型。', '2021-07-14', '2021-07-21', 150, '010.jpg', '', '', '', '2021-05-05 13:29:02', '2021-05-05 13:29:02'),
(11, 'C', '011', '故宮南院戶外美術館-藝術方舟ARK OF ART', '藝術的方舟Ark of Art，故宮南院匯聚了當代與傳統，如同一艘行駛於歷史長河上的方舟，承載著藝術傳承的使命，包容文化與歷史的的多元，貯存、典藏所有的藝術生命，憑藉戶外美術館的成立，期許在自由的公共藝術空間中，滿足人們探索藝文人文的渴望，並建立生命與情感之連結 蒐集人類的足跡，航向世界的藝術烏托邦。\r\n', '2021-07-22', '2021-08-12', 200, '011.jpg', 'TNN', '', '', '2021-05-05 13:29:02', '2021-05-05 13:29:02'),
(12, 'D', '101', '品牌視覺設計研究工坊', '本課程由瘋設計與大象設計 Elephant Design負責人王胤卓設計師 共同企劃，透過五週的課程解說與工作坊操作帶領學員進入專業品牌視覺設計工作。從品牌的視覺設計切入，融入創意思考方式，延伸到品牌延伸應用物甚至到空間設計，建立完整設計概念輸出之邏輯訓練 ， 以達視覺形式與傳達精神能恰如其分的精準設計成果 。', '2021-05-20', '2021-05-19', 1500, '101.jpg', 'KHH', '', '', '2021-05-05 13:41:34', '2021-05-05 13:41:34'),
(13, 'D', '102', '想像吧！假如瑞芳是個主題樂園！', '瑞芳的勇者，讓我們一邊打怪一邊幫城市升級！！！！！我們發起了一場遊戲，等你來挑戰！！！！！！我們會帶的你走遍大瑞芳地區，由你來發現感動人心的小角落，讓這些特別的時刻紀錄成瑞芳藏寶圖！', '2021-05-13', '2021-05-19', 1500, '102.jpg', 'TPE', '', '', '2021-05-05 13:41:34', '2021-05-05 13:41:34'),
(14, 'D', '103', '家物事HOUSING THINGS', '「家物事：一場發生在藝術空間的聚落與實踐」是一場正在臺藝大有章藝術博物館展出的，關於策展情境、藝術再現、公眾參與，以及空間歷史的展覽。而這場藝術家工作坊，將由五組藝術家主導，和參與者們一同在展場間駐留、移動，討論各種「家」、「物」、「事」的聚落與實踐。', '2021-05-18', '2021-05-24', 700, '103.jpg', 'TXG', '', '', '2021-05-05 13:41:34', '2021-05-05 13:41:34'),
(15, 'D', '104', '品牌設計實戰工作坊', '視覺設計是帶給消費者的第一印象，以及產生記憶點最佳的方式，但在製作設計之前更需要了解品牌的市場及價值。為擴大三創成效、爭取外部資源，本校與高雄市政府青年局合作辦理「品牌設計實戰工作坊」。本工作坊旨在學習品牌策略及視覺發展，從無到有建構品牌，嚴謹的品牌分析、品牌策略擬定到企業識別規劃，迅速建立對品牌的認知，讓學員學習了解視覺設計與品牌之間的關聯性，並期許學員運用在自身領域，並培育不同領域之專業與創新創業能力。', '2021-05-18', '2021-05-31', 2500, '104.jpg', 'TXG', '', '', '2021-05-05 17:46:37', '2021-05-05 17:46:37'),
(16, 'D', '105', '歌仔戲工作坊', '上班族如何在忙碌工作中進修？面對日常壓力時，內心總是感到焦慮煩躁嗎？來歌劇院充電吧！邁入第二年的「藝術動一動」以「身體律動」、「歌仔戲」與「音樂劇」三大主題，讓您在打卡下班後、轉換心情，從輕食、暖身開始，以沉浸、體驗舒展身心靈，享受精彩充電夜。', '2021-05-19', '2021-05-31', 2000, '105.jpg', 'TPE', '', '', '2021-05-05 13:41:34', '2021-05-05 13:41:34'),
(65, 'C', '023', '測試修改', '哈哈哈喔', '2021-08-09', '2021-08-10', 150, '20210506012038.jpg', NULL, NULL, '', '2021-05-06 04:13:17', '2021-05-06 04:13:17');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `event`
--
ALTER TABLE `event`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=2;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `event`
--
ALTER TABLE `event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '流水號', AUTO_INCREMENT=68;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
